src/main/resources/de/cismet/cids/custom/wunda_blau/search/actions/georg/getJobStatus_Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:getJobStatus soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://webservice.portaladapter.vermunterlagenportal.aedsicad.de">
			<in0 xsi:type="xsd:string">%s</in0>
		</ns1:getJobStatus>
	</soapenv:Body>
</soapenv:Envelope>